Revit 2027 API
StructuralConnectionHandler.RemoveReferences Method
 Removes references from the connection. All references in an array should belong to the connection.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveReferences(
	IList<Reference> picks
)
Public Sub RemoveReferences (
	picks As IList(Of Reference)
)
public:
void RemoveReferences(
	IList<Reference^>^ picks
)
member RemoveReferences :
        picks : IList<Reference> -> unit
Parameters
picks IList<Reference>
 The array containing picks to be removed.
Exceptions
Exception | Condition
ArgumentException |  One or more picks was not permitted to be removed from the connection. Picks should be members of the connection.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace